Setelah pada pertemuan sebelumnya kita membahas bagaimana membuat dataframe, kali ini kita akan membahas lebih lanjut terkait apa saja yang dapat kita lakukan dengan dataframe. Tapi sebelumnya kita import pandas dahulu sebagai pd dan numpy sebagai np

In [1]:
import pandas as pd
import numpy as np

# Memanggil data tertentu pada dataframe

Misal kita punya dataframe sebagai berikut:

In [2]:
data = [['Purwanto',32],['Purnomo',43],['Purwo',55]]
df2 = pd.DataFrame(data,columns=['Nama','Usia'])
print(df2)

       Nama  Usia
0  Purwanto    32
1   Purnomo    43
2     Purwo    55

Dan ingin memanggil kolom tertentu

In [3]:
df2["Nama"]

0    Purwanto
1     Purnomo
2       Purwo
Name: Nama, dtype: object

In [4]:
df2["Usia"]

0    32
1    43
2    55
Name: Usia, dtype: int64

In [5]:
df2["Nama"][0]

'Purwanto'

In [6]:
df2.iloc[0][0]

'Purwanto'

In [7]:
df2.loc[0]["Nama"]

'Purwanto'

In [8]:
df2.at[0,"Nama"]

'Purwanto'

In [9]:
df2.iat[0,0]

'Purwanto'

In [10]:
df2.iloc[0]

Nama    Purwanto
Usia          32
Name: 0, dtype: object

In [11]:
df2.loc[:,'Nama']

0    Purwanto
1     Purnomo
2       Purwo
Name: Nama, dtype: object

# Set Index

In [12]:
df3 = pd.DataFrame([['Purwanto',32],['Purnomo',43],['Purwo',55]],columns=['Nama','Usia'])
df3

       Nama  Usia
0  Purwanto    32
1   Purnomo    43
2     Purwo    55

In [13]:
df3.set_index("Nama")

          Usia
Nama
Purwanto    32
Purnomo     43
Purwo       55

# Pemanggilan Baris

In [14]:
df4 = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), index= [2, 'A', 4], columns=[48, 49, 50])
df4

   48  49  50
2   1   2   3
A   4   5   6
4   7   8   9

In [15]:
df4.loc[2]

48    1
49    2
50    3
Name: 2, dtype: int32

In [16]:
df4.iloc[2]

48    7
49    8
50    9
Name: 4, dtype: int32

# Menambah Kolom

In [17]:
#Menambahkan index di kolom baru
df5 = pd.DataFrame([['Purwanto',32],['Purnomo',43],['Purwo',55]],columns=['Nama','Usia'])
df5["Index"]=df5.index
df5

       Nama  Usia  Index
0  Purwanto    32      0
1   Purnomo    43      1
2     Purwo    55      2

In [18]:
#Menambahkan kolom dengan isian baru
df5.loc[:, "Gender"] = pd.Series(['L','L','L'])
df5

       Nama  Usia  Index Gender
0  Purwanto    32      0      L
1   Purnomo    43      1      L
2     Purwo    55      2      L

# Melihat ukuran dataframe

In [19]:
#ukuran baris paling panjang
len(df2)

3

In [20]:
#ukuran baris pada kolom tertentu
len(df2["Nama"])

3

In [21]:
#ukuran baris, ukuran kolom dataframe
print(df2.shape)

(3, 2)

# Menghapus

In [22]:
df6 = pd.DataFrame([['Purwanto',32],['Purnomo',43],['Purwo',55]],columns=['Nama','Usia'])
df6

       Nama  Usia
0  Purwanto    32
1   Purnomo    43
2     Purwo    55

In [23]:
#menghapus kolom
del df6['Nama']
df6

   Usia
0    32
1    43
2    55

In [24]:
#Menghapus n baris di awal
df6=df6[2:]
df6

   Usia
2    55

In [25]:
df6 = pd.DataFrame([['Purwanto',32],['Purnomo',43],['Purwo',55]],columns=['Nama','Usia'])
df6

       Nama  Usia
0  Purwanto    32
1   Purnomo    43
2     Purwo    55

In [26]:
#Menghapus baris tertentu
df6=df6.drop(df6.index[[0,2]])
df6

      Nama  Usia
1  Purnomo    43